[
  {
    "name" : "Alfalfa",
    "also_known_as": "Medicago sativa, Lucerne.",
    "description": "Alfalfa has been around for centuries and is an overlooked wonder food. It is helpful for just about all kinds of health problems, especially those caused by nutritional deficiencies. Historically, the benefits of alfalfa were discovered centuries ago by Arabian horsemen who, upon feeding this wild edible to their livestock, noticed a jump in energy and performance. People who eat alfalfa report similar benefits. Many medical naturopathic doctors and alternative health professionals state that alfalfa is not only nutritious, it is an effective remedy for many ailments and it is used in the treatment for alcoholism and drug dependency.",
    "edible": "Leaves and young shoots can be eaten raw or cooked. The leaves can also be dried for later use as a tea or tossed into soups. A very nutritious food in moderation, though it can trigger attacks in patients with systemic lupus erythematosus. The seed is commonly used as a sprouted seed which is added to salads, used in sandwiches, added to soups or eaten as is. Alfalfa seeds can also be ground into a powder and mixed with cereal flours for making nutritionally improved breads and other baked goods. An appetite-stimulating tea is made from the leaves and can be sweetened with honey.",
    "sources": ["https://www.ediblewildfood.com/alfalfa.aspx"]
  },
  {
    "name" : "Chive blossoms",
    "also_known_as": "Wild Chives, Allium schoenoprasum.",
    "description": "Wild chives are native to North America, but they have also escaped from cultivation, making it difficult to separate the native populations from the cultivated variety. They are easy to spot and their scent is just like cultivated chives. They are in the Alliaceae family and have a long history of being used medicinally. The most common medicinal use of chives has been in treating coughs and colds. The juice was usually boiled down to a thick syrup. They have been used to aid in the stimulation of the appetite and to help with digestion.",
    "edible": "Wild chives can be used like its close cousin, domestic chives, for flavoring salads, vegetables and meat dishes. The flowers, leaves, stems and bulbs are edible.",
    "sources": ["https://www.ediblewildfood.com/wild-chives.aspx"]
  },
  {
    "name" : "Borage",
    "also_known_as": "Borago officinalis.",
    "description": "Borage is a hardy annual edible that is known for its beauty. It’s a domestic herbal remedy that has been used since ancient times. Some people use borage as a substitute for valerian as it dispels melancholy and induces euphoria. Borage has a beneficial effect on the heart, adrenal glands, kidneys and the entire digestive system. It has been used as a cure for jaundice. This beautiful plant works well as a companion plant as it deters tomato hornworm and Japanese beetles; it also stimulates the growth of strawberries.",
    "edible": "Leaves have been traditionally used to make a tea to rid the body of a fever. Although they can be cooked eating them raw is not recommended due to the ‘prickles’ it is best not to. Flowers are very tasty and can be tossed into salads or they can be crystallized to make a “candy.” The seeds are a rich source of gamma-linolenic acid; this oil helps to regulate the hormonal systems and lowers blood pressure. An edible blue dye can be obtained from the flowers; some people use it to colour vinegar however it turns pink on contact with acids.",
    "sources": ["https://www.ediblewildfood.com/borage.aspx"]
  },
  {
    "name" : "Burdock",
    "also_known_as": "Arctium Spp., Common Burdock.",
    "description": "Recognized mainly for its burrs, burdock is an interesting biennial plant. This plant is known as a nuisance weed in many areas across the U.S. and Canada, yet it is a valuable crop in Japan. In Japan, it is called gobo. Burdock root consists primarily of carbohydrates, volatile oils, plant sterols, tannins, and fatty oils. In its first year of growth this plant has no stem and grows only as a basal rosette of leaves. At the beginning of the second year the stem grows and it continues its life cycle. The burrs are credited with inspiring Swiss inventor George de Mestral to invent Velcro in the 1940’s.",
    "edible": "First-year roots are used in a variety of ways. Stems can be cooked by boiling for about 20 minutes, but they will need seasoning. Before cooking, the stems should be peeled. The Japanese have been known to eat the leaves when it is young and leaves are soft, but they are quite bitter. Seeds are edible in small quantities.",
    "sources": ["https://www.ediblewildfood.com/burdock.aspx"]
  },
  {
    "name" : "Calendula",
    "also_known_as": "Calendula officinalis.",
    "description": "Calendula, also known as pot marigold, is at the top of the most popular annuals in the garden list. Well known for its healing properties and edible flowers (leaves also), this flower looks great in any garden. Easy to grow, seeds can be started indoors in the late winter, or sow them directly into the garden in the spring. When you deadhead spent flowers it promotes the plant to produce additional blooms. This species is an Old World potherb and garden plant that was quite popular in England at the time of Shakespeare. This medicinal plant was mentioned back in the 12th century in the writings of the Saint Hildegard von Bingen.",
    "edible": "The leaves and petals of this plant are edible. The leaves are typically bitter and often are added to leafy salads. The fresh petals are used as a garnish, seasoning, or a traditional yellow cheese colorant. Calendula was also used historically as medicine and a dye for fabrics, foods, and cosmetics.",
    "sources": ["https://www.ediblewildfood.com/calendula.aspx", "https://hort.extension.wisc.edu/articles/calendula-calendula-officinalis"]
  },
  {
    "name" : "Cattail",
    "also_known_as": "Typha latifolia, Bullrush.",
    "description": "The cattail is one of the most important and most common wild foods that also boast a variety of uses at different times of the year. Cattails (aka bulrushes) can be used to make mats, baskets, and the cigar-shaped head can even be used as packing material. Dipping the head in oil or fat, they can be used as torches. Aboriginals used the roots to make flour (high in protein and carbohydrates) and the fluffy wool of the head was used as diapers because of its softness and absorbency. The fluffy wool is similar to down and can be used as insulation in clothing, pillows, mattresses, quilts, and life jackets. These “cigar-heads” are also excellent fire started. The tight heads are often dry inside even after a heavy rain, making this essential survival tinder. Inside the stalks of fresh shoots is tasty food that can be eaten as is, sautéed or tossed into a stir fry.",
    "edible": "The lower parts of the leaves can be used in a salad; the young stems can be eaten raw or boiled; the young flowers (cattails) can be roasted. Yellow pollen (appears mid-summer) of the cattail can be added to pancakes for added nutrients. Shake the pollen into a paper bag and use it as a thickener in soups and stews or mix it with flour for some great tasting bread. The root can be dried and pounded to make nutritious flour. Young shoots can be prepared like asparagus but requires longer cooking time to make them tender. Added to soup towards the end of cooking, they retain a refreshing crunchiness. They're superb in stir-fry dishes and excellent in virtually any context.",
    "sources": ["https://www.ediblewildfood.com/cattail.aspx"]
  },
  {
    "name" : "Chickweed",
    "also_known_as": "Stellaria media, Common Chickweed.",
    "description": "There are two chickweeds (Stellaria media and Cerastium fontanum) that are virtually indistinguishable unless closely examined. Both are mat-forming, in the Caryophyllaceae family, and occur in many countries. While the flowers are similar, mouse-ear chickweed (Cerastium fontanum) is easily distinguished by its fuzzy leaves and stems, whereas common chickweed (the variety discussed below) has hairless leaves and a single row of hairs along the stems. This edible plant is multi-functional since its presence decreases insect damage to other plants. It is a short-lived perennial that grows from taproots and often from sprawling, nodally-rooting branches.",
    "edible": "Leaves are used by adding them raw to salads and sandwiches. They can be tossed into soups and stews as well. When adding to a cooked dish, the stems and flowers can be used also.",
    "sources": ["https://www.ediblewildfood.com/chickweed.aspx"]
  },
  {
    "name" : "Chicory",
    "also_known_as": "Cichorium intybus",
    "description": "Chicory is a perennial herbaceous plant with a blue or lavender flower. Its leaves are tastiest in the spring and autumn as the summer heat tends to make them taste a little bitter – but they are still edible. Toss them in a salad but before doing so, blanch them. They can be mixed with other greens to minimize their strong flavor. The mature green leaves can be used as a cooked vegetable.",
    "edible": "Leaves and root. Although the flower is edible, it is very bitter.",
    "sources": ["https://www.ediblewildfood.com/chicory.aspx"]
  },
  {
    "name" : "Allium",
    "also_known_as": "Allium ampeloprasum, Allium canadense, Allium cepa, Allium cernuum, Allium fistulosum.",
    "description": "This genus contains a number of species that are commonly cultivated as food plants. Most people who grow their own vegetables will grow onions and leeks, they will often also grow garlic, shallots and chives, whilst those who are more adventurous might be growing garlic chives, tree onions, everlasting onions and welsh onions. These are all very worthwhile and productive crops but there are also many other members of this genus that are more than worthy of a place in the food garden. Many of these alternative species are also very ornamental and are often grown in the flower garden.",
    "edible": "All parts of the plants are edible - we normally confine ourselves to the leaves and the flowers, but many species produce bulbs and these can also be eaten, though they will be much smaller than cultivated onion bulbs.",
    "sources": ["https://pfaf.org/user/cmspage.aspx?pageid=51"]
  },
  {
    "name" : "Coltsfoot",
    "also_known_as": "Tussilago farfara, Coughwort.",
    "description": "Coltsfoot is a perennial plant that looks similar to a dandelion when it blooms in spring. This wild edible plant is unusual in that the flowers bloom and die before the appearance of any leaves, which earned Coltsfoot the name of 'son before the father' in earlier times. Before the introduction of matches, the felt-like covering of the plant, wrapped in a rag and dipped in a solution of saltpetre, was considered to be excellent tinder after being dried in the sun. This plant contains mucilage, bitter glycosides, and tannins; it is these that are thought to give the herb anti-inflammatory and antitussive (cough prevention and treatment) properties. Coltsfoot root contains pyrrolizidine alkaloids, potentially toxic constituents and it suspected that there may be small quantities in the leaves.",
    "edible": "Very small quantities of fresh young leaves can be used in salads. Leaves are most recognized as being used for treating respiratory disorders (for example colds, bronchitis, cough and allergic asthma attacks). According to many herbalists, coltsfoot leaves and flowers are recommended in the form of syrup or infusions to soothe the mentioned respiratory disorders. Never ingest or use this plant without proper consultation with a qualified health professional.",
    "sources": ["https://www.ediblewildfood.com/coltsfoot.aspx"]
  },
  {
    "name" : "Common mallow",
    "also_known_as": "Malva neglecta, Cheeseweed.",
    "description": "The common mallow is in the Malvaceae family that include cotton, okra and hibiscus. The fruits are round and have cheese-like wedges which give the common mallow its nickname, the cheese plant. Common mallow is related to the marsh mallow plant which, as its name suggests, is where the first marshmallows came from. However, marshmallows were nothing as they are today. They were created as a medicinal treat for sore throats. Common mallow is an anti-inflammatory, diuretic, demulcent, emollient, laxative and an expectorant. Depending on location, the common mallow is a winter or summer annual or biennial.",
    "edible": "All parts of this plant are edible. The leaves can be added to a salad, the fruit can be a substitute for capers and the flowers can be tossed into a salad. When cooked, the leaves create a mucus texture very similar to okra and can be used to thicken soups and stews. Dried leaves can be used for tea. Mallow roots release a thick mucus when boiled in water. The thick liquid that is created can be beaten to make a meringue-like substitute for egg whites. Common mallow leaves are rich in vitamins A and C as well as calcium, magnesium, potassium, iron and selenium.",
    "sources": ["https://www.ediblewildfood.com/mallow.aspx"]
  },
  {
    "name" : "Common milkweed",
    "also_known_as": "Asclepias syriaca, Silkweed.",
    "description": "Milkweed is an herbaceous, tall perennial that got its name for its milky sap that contains latex, alkaloids and other compounds. Carl Linnaeus, Swedish botanist (1707-1778), named the genus after Asclepius, the Greek god of healing because of the many folk-medicinal uses for this plant. Milkweed supplies tough fibers for making cords and ropes, and for weaving coarse cloth. Proper identification of this wild plant is very important since it has a poisonous look alike called dogbane.",
    "edible": "The flower heads can be fried in batter and eaten. The flower buds first appear in early summer and can be harvested for about seven weeks. They look like immature heads of broccoli but have roughly the same flavour as the shoots. These milkweed flower buds are wonderful in stir-fries, soups, rice casseroles, and many other dishes. Milkweed pods are delicious in stew or just served as a boiled vegetable, perhaps with cheese or mixed with other vegetables but be sure you eat only immature pods. Boiled young shoots, unopened flower buds, flowers, and young pods are said to taste as good as asparagus and other cooked greens. The only way to eat milkweed is as a young shoot (under 15 cm).",
    "sources": ["https://www.ediblewildfood.com/milkweed.aspx"]
  },
  {
    "name" : "Common vetch",
    "also_known_as": "Vetch, Common Vetch, Poor Man Peas, Bush Vetch, Tare.",
    "description": "Vetch is a member of the Pea or Fabaceae family, it’s one of the largest families in nature and there are around 240 Vetches worldwide.\nThe most common in the UK is Common Vetch (Vicia sativa). They can sometimes be hard to tell apart so if you just collect Vetches that have purple flowers that grow along the flower stem you’ll be safe.",
    "edible": "The leaves and the flowers can be eaten raw or cooked, they taste just like fresh peas and are a great addition to a salad.",
    "sources": ["https://totallywilduk.co.uk/2022/02/14/vetch-vicia-sativa-identification"]
  },
  {
    "name" : "Common yarrow",
    "also_known_as": "Achillea millefolium, Yarrow.",
    "description": "Achillea millefolium is known as common yarrow. It is a rhizomatous, spreading, upright to mat-forming perennial that is considered by many to be an aggressive weed. Common yarrow from Europe and Asia was originally introduced to the U.S. during the colonial times, and has since naturalized throughout the U. S. and Canada. Achillea is in reference to Achilles, hero of the Trojan Wars in Greek mythology, who used the plant medicinally to stop bleeding and to heal the wounds of his soldiers.",
    "edible": "Leaves can be consumed raw or cooked. They have a somewhat bitter flavor yet they make a great addition to mixed salads. They are best used when young. Common yarrow leaves are also used as a hop-substitute for flavouring and as a preservative for beer. Although in general yarrow is a very nutritious and beneficial plant to add to the diet, it is recommended that this not be consumes in large quantities. Tea is made from the flowers and leaves.",
    "sources": ["https://www.ediblewildfood.com/common-yarrow.aspx"]
  },
  {
    "name" : "Coneflower",
    "also_known_as": "Echinacea, ",
    "description": "Echinacea, commonly known as purple coneflower, is an herbaceous perennial plant with four species and six varieties all indigenous to North America. This popular plant has been used in perennial gardens for over 200 years and is widely known. It has also been used historically in North America by indigenous people as a medicinal herb. It’s also used as wild edible food and provides nutrition in addition to many health benefits. Echinacea comes from the Greek word 'echinos' meaning hedgehog in reference to the spiny center cone.",
    "edible": "Leaves and flower petals are edible. All parts of the plant have been used in tinctures or other medicinal methods.",
    "sources": ["https://www.ediblewildfood.com/echinacea.aspx"]
  },
  {
    "name" : "Cow parsley",
    "also_known_as": "Wild chervil.",
    "description": "A herbaceous biennial or short-lived perennial plant in the family Apiaceae and related to parsley, carrot, hemlock and hogweed. that can be confused with giant cow parsley (Heracleum mantegazzianum) or French cow parsley (Orlaya grandiflora). Some medicinal, edible and other uses although it does have an unpleasant flavour. Common names include cow parsley, wild chervil, wild beaked parsley, keck,or Queen Anne's lace.",
    "edible": "The leaves are eaten raw, cooked as a potherb or used as a flavouring. They taste somewhat less than wonderful. Root - cooked.",
    "sources": ["https://pfaf.org/user/Plant.aspx?LatinName=Anthriscus+sylvestris"]
  },
  {
    "name" : "Cowslip",
    "also_known_as": "Cowslip primrose.",
    "description": "The cowslip is a spring flowering, herbaceous perennial wildflower, that’s a member of the primrose family of plants. Growing to a maximum height of 25 – 30cm, it was once a common sight in meadows, hedgerows, dyke banks and open woodland. However, unfortunately due to loss of habitat caused by modern farming practices, it has since been in steady decline.\nIt is thought that its name comes from the old English for ‘cow dung’ or ‘cow pat’, because they traditionally grew in meadows where there were cows. Another school of thought on its name, simply referrers to the wet, boggy habitat that this plant is often found.\nCowslips grow well on most soil types, however, they do best when they receive ample sunlight and struggle in shaded locations. They are often confused with the oxlip, which is a hybrid of the cowslip and wild primrose, however the oxlip has a paler flower, which is larger and opens out further, similar to the primrose.",
    "edible": "Young leaves - raw or cooked in soups etc. They are not that tasty, but are available in late winter which adds somewhat to their value. The fresh or dried leaves are used as a tea substitute. Flowers - raw, cooked or used in conserves, as a garnish etc. They make an ornamental addition to the salad bowl. This species has become much less common in the past 100 years due to habitat destruction, over-collecting from the wild and farming practices. When it was more abundant, the flowers were harvested in quantity in the spring and used to make a tasty wine with sedative and nervine properties. A related species Primula elatior is listed by the Council of Europe as a natural food flavouring.",
    "sources": ["https://pfaf.org/user/Plant.aspx?LatinName=Primula+veris", "https://diversegardens.co.uk/wildflowers/wildflower-gallery/cowslip"]
  },
  {
    "name" : "Crimson clover",
    "also_known_as": "Trifolium incarnatum, Scarlet Clover.",
    "description": "Crimson clover is a species of clover in the family Fabaceae, native to southeastern Europe and southwestern Turkey. It spread to Asia and then to the U.S. by 1819. It has a distinctive, brilliant, crimson cone-shaped head of florets.",
    "edible": "The seeds and flowers are edible. Seeds can be sprouted and used in salads or sandwiches. They can also be dried and ground into flour. Flower heads can be used fresh or dried as a tea.",
    "sources": ["https://www.ediblewildfood.com/crimson-clover.aspx"]
  },
  {
    "name" : "Crithmum maritimum",
    "also_known_as": "Rock Samphire.",
    "description": "Great for those who simply want to grab and snack on the go while visiting the seashore. Rock samphire can be found in abundance in coastal areas, particularly on rocks by the sea. Its season lasts from May until around September.\nSamphire is a perennial and can be identified by its green fleshy stems and wide yellowish-green flowers.",
    "edible": "Leaves - raw or cooked. Vaguely reminiscent of fennel, but the taste is more bitter and brackish. A powerful salty flavour, it has been described by one person as tasting like 'a mixture of celery and kerosene'. The leaves are used as a flavouring in salads etc. Gathered in spring, the young leaves when sprinkled with salt and boiled make a very good pickle. The leaves are rich in vitamin C. Seed pods. They are used to make a warm aromatic pickle.",
    "sources": ["https://spillthebeans.ie/wild-rock-samphire", "https://pfaf.org/User/Plant.aspx?LatinName=Crithmum+maritimum"]
  },
  {
    "name" : "Daisy",
    "also_known_as": "Bellis perennis.",
    "description": "Daisy, a humble little flower that is widespread in many parts of the world. A children’s favourite for making ‘daisy chains’ or ‘fairy chains’, the daisy has also been used in food and medicine.",
    "edible": "Leaves, flowers, and roots.The young flower heads or buds can be added to salads, soups or sandwiches; or the flower heads used to decorate salad dishes. The leaves can be eaten raw despite their bitter aftertaste, but are better mixed in salads or cooked and might be used as a potherb. The buds can be preserved in vinegar and used in cooking as a substitute for capers.",
    "sources": ["https://www.eatweeds.co.uk/daisy-bellis-perennis"]
  },
  {
    "name" : "Dandelion",
    "also_known_as": "Taraxacum officinale, Lion’s Tooth.",
    "description": "Dandelions are often considered a pesky weed in Canada and the U.S. yet European and Asian nations have greatly benefited for years from the incredible nutritional value that this weed contains. They are a rich source of vitamins, minerals and it even has antioxidants. For example, one cup of raw dandelion greens contains 112% of your daily required intake of vitamin A and 535% of vitamin K. The common yellow dandelion has a long list of powerful healing abilities as well as other health benefits. Contrary to popular belief, this is a beneficial plant to have. It’s a great companion plant for gardening because it’s long taproot brings up nutrients to the shallow-rooting plants in the garden adding minerals and nitrogen to the soil. It also attracts pollinating insects such as bees, which helps fruits to ripen.",
    "edible": "Leaves, root, and flower. The leaves can be added to a salad or cooked, and can be dried and stored for the winter (they can also be blanched and frozen). Flowers can be made into juice, or added into many recipes. The root can be made into a coffee substitute, and the root along with the leaves can be dried, stored and made into tea.",
    "sources": ["https://www.ediblewildfood.com/dandelion.aspx"]
  },
  {
    "name" : "Fennel",
    "also_known_as": "Foeniculum vulgare",
    "description": "Wild fennel is harvested extensively all around the world. It is highly regarded in various cultures for its flavour and beneficial qualities. This is the same species as the fennel you find in the supermarket; however, the latter variety with its swollen bulb has been bred for mass cultivation.\nWild fennel is a master of adaptability, growing proficiently on disturbed land; for example, on the side of the road, on demolition sites or along train lines. It is essential to check whether the area to be harvested has been affected by local pollutants and run-off.",
    "edible": "leaf, stalk, flower, pollen seed, shoot. All parts of the wild fennel plant are completely edible, from the base to the seeds. Its leaves are best eaten when very young. I love to pull out the new shoots as they form at the nodes of the stalks, peel off the layers to get to the juicy core and enjoy a sweet, crunchy and so delicious wild treat. Older leaves can be used as a garnish or chopped up and cooked with other vegetables. The aromatic seeds are used as a flavouring in cakes, bread and stuffing mixes.",
    "sources": ["https://thamesandhudson.com.au/a-field-guide-to-foraging-for-wild-fennel-a-delicious-wild-fennel-seed-and-pumpkin-soup-recipe/"]
  },
  {
    "name" : "Fireweed",
    "also_known_as": "Chamerion angustifolium, Willow Herb.",
    "description": "Fireweed is a native plant that’s found throughout the temperate northern hemisphere including some areas in the boreal forests. It earned its name because this plant is the first colonizer in the soil after forest fires. In Great Britain it also earned the name bombweed due to the rapid colonization of land that was bombed during WWII. Fireweed is an important plant for honey producers as it attracts the bees and hummingbirds as well. This beautiful plant is a member of the Evening Primrose family (Onagraceae).",
    "edible": "Young leaves and shoots can be consumed. They can be used in salads, as a vegetable, and young shoots can be used as an asparagus substitute. Older shoots become too tough to ingest.\nThe root can be roasted after scraping off the outside, but often tastes bitter. To mitigate this, the root is collected before the plant flowers and the brown thread in the middle removed. Flower stalks can be consumed raw or cooked and are used when the flowers are in bud. The pith of young or older stems are consumable raw or cooked.",
    "sources": ["https://www.ediblewildfood.com/fireweed.aspx"]
  },
  {
    "name" : "Gardenia",
    "also_known_as": "Gardenia jasminoides, Cape jasmine.",
    "description": "Gardenia jasminoides, is an evergreen flowering plant in the coffee family Rubiaceae. It is native to parts of South-East Asia. Wild plants range from 30 centimetres to 3 metres (about 1 to 10 feet) in height. They have a rounded habit with very dense branches with opposite leaves that are lanceolate-oblong, leathery or gathered in groups on the same node and by a dark green, shiny and slightly waxy surface and prominent veins.",
    "edible": "Gardenia flowers can be eaten raw, pickled, or preserved in honey. In China, the petals are used in tea for their aroma, while a yellow-red dye used in textiles and sweets has been extracted from the pulp of the fruit.",
    "sources": ["https://en.wikipedia.org/wiki/Gardenia_jasminoides"]
  },
  {
    "name" : "Garlic mustard",
    "also_known_as": "Alliaria petiolata, Jack-by-the-Hedge.",
    "description": "Garlic Mustard is a biennial herb that has been labeled an invasive weed in many areas. Originally from Europe, this nutritious plant is found in many locations across North America. The flower of this wild edible only appears from May to June. Garlic Mustard is good for your weight, heart, lowers cholesterol, may help prevent cancer, as well as many other health benefits.",
    "edible": "Flowers, leaves, roots and seeds. Leaves in any season can be eaten but once the weather gets hot, the leaves will taste bitter. Flowers can be chopped and tossed into salads. The roots can be collected in early spring and again in late fall, when no flower stalks are present. Garlic mustard roots taste very spicy somewhat like horseradish. In the fall the seed can be collected and eaten.",
    "sources": ["https://www.ediblewildfood.com/garlic-mustard.aspx"]
  },
  {
    "name" : "Geranium",
    "also_known_as": "cranesbill",
    "description": "Geranium, (genus Geranium), any of a group of about 300 species of perennial herbs or shrubs in the family Geraniaceae, native mostly to subtropical southern Africa. Geraniums are among the most popular of bedding and greenhouse plants. The closely related genus Pelargonium contains some 280 species of annual, biennial, and perennial herbaceous plants that are commonly called geraniums.",
    "edible": "Some websites desrcibe it as 'Although Geranium's isn't thought to be poisonous, it isn't considered to be edible either'[2] and other websites say 'The leaves and flowers of scented geraniums are edible. Thanks to the essential oils in their leaves, they lend not only decorative touches but also a fine aroma to meat dishes, salads and desserts.'[3]",
    "sources": ["https://www.britannica.com/plant/geranium-plant-genus-Geranium", "https://www.jeremybartlett.co.uk/2018/01/06/bloody-cranesbill-geranium-sanguineum", "https://www.housebeautiful.com/uk/garden/plants/g22040372/geraniums-pelargonium-facts"]
  },
  {
    "name" : "Ground ivy",
    "also_known_as": "Creeping Charlie, Glechoma hederacea.",
    "description": "If you were to search for Creeping Charlie on the Internet you'll quickly discover that there are more websites that offer suggestions to eradicate this plant instead of eating it. This aromatic, perennial, evergreen creeper is in the mint (Lamiaceae) family. Creeping Charlie is an herbaceous plant that spreads by seed and by stolons (creeping stems). Native to Europe, it was brought to North American by the European settlers as medicine and as a ground cover. This minty edible contains a lot of vitamin C and offers a multitude of health benefits. This plant overwinters maintaining its colour under the snow.",
    "edible": "Young leaves can be eaten raw or cooked. The leaves have a mild mint-like flavour and can be tossed into salads to add a slight aromatic tang. Creeping Charlie leaves can also be cooked like spinach, added to soups, stews, or omelettes. Tea is made from the fresh or dried leaves. It is often used mixed with verbena leaves or lovage. This wild edible has been added to beer in much the same way as hops in order to clear it and also to improve its flavour.",
    "sources": ["https://www.ediblewildfood.com/creeping-charlie.aspx"]
  },
  {
    "name" : "Harebell",
    "also_known_as": "Campanula rapunculoides, Bluebell bellflower.",
    "description": "The harebell is a delicate perennial that has a graceful appearance. They have slender stems, sometimes in clusters and some are so weak the plant bends over. Interestingly an old name for this plant in Scotland was Witched Thimble due to old folklore. The genus name, from the Latin campana (bell), means little bell.",
    "edible": "The leaves of this plant are edible and are best used in a salad. Add them to a smoothie, into your homemade dips or anywhere else to add some of its vitamin C.",
    "sources": ["https://www.ediblewildfood.com/harebell.aspx"]
  },
  {
    "name" : "Henbit",
    "also_known_as": "Lamium amplexicaule.",
    "description": "The common name, Henbit, comes from the observation that chickens like it. Humming birds also enjoy this wild edible for the nectar. Henbit provides valuable erosion control in many cropland fields in the southern U.S. Unlike many of its relatives in the mint family, it does not have a strong or distinctive mint scent. It is also easily confused with Purple Deadnettle (L. purpureum), which has petioled leaves all the way to the top leaves. The middle and upper leaves of L. amplexicaule (henbit) do not have petioles, and the leaves are typically smaller than those of Purple Deadnettle. This edible plant is also an important early season source of nectar and pollen for honeybees.",
    "edible": "Henbit can be consumed fresh or cooked as an edible herb, and it can be used in teas. The stem, flowers, and leaves are edible, and although this is in the mint family, many people say it tastes slightly like raw kale, not like mint. It is very nutritious, high in iron, vitamins and fibre. You can add it raw to salads, soups, wraps, or green smoothies. According to Natural Medicinal Herbs this edible plant is anti-rheumatic, diaphoretic, an excitant, febrifuge, a laxative and a stimulant.",
    "sources": ["https://www.ediblewildfood.com/henbit.aspx"]
  },
  {
    "name" : "Knapweed",
    "also_known_as": "Centaurea nigra.",
    "description": "The common knapweed has the nickname of Hardheads. If you pinch off an old flower head in the autumn, pull off any loose seed heads, there is a very hard kernel. If you then carefully split this there is a good chance that there will be a small grub inside. Goldfinches can often be found feeding on these grubs. This plant can survive for years in both grazed pasture and neglected grassland areas. Flowers are pollinated by a wide range of insects including bees, flies, butterflies and beetles and the seed heads attract goldfinches and other seed feeding birds.",
    "edible": "Only the flowers are edible. This plant has some medicinal purposes.",
    "sources": ["https://www.ediblewildfood.com/knapweed.aspx"]
  },
  {
    "name" : "Meadowsweet",
    "also_known_as": "Spiraea alba, White Meadowsweet.",
    "description": "Meadowsweet is a perennial plant in the Rosaceae family. Although edible, meadowsweet is more recognized as an herbal medicine used to help with many maladies. In particular the flower head contains salicylic acid. The flowers produce nectar and pollen attracting various bees, wasps, adult long-horned beetles (Cerambycidae), and the moth Ctenucha virginica (Virginia Ctenucha).",
    "edible": "Young leaves are edible but are commonly used in soups and to make tea.",
    "sources": ["https://www.ediblewildfood.com/meadowsweet.aspx"]
  },
  {
    "name" : "Mullein",
    "also_known_as": "Verbascum thapsus, Cowboy Toilet Paper.",
    "description": "Mullein is a soft (almost velvet-like) biennial that can grow very tall. This dicotyledonous plant produces a rosette of leaves in its first year of growth. The second year plant normally produces a single unbranched stem. The tall pole-like stem ends at a dense spike of yellow flowers. It is a common wild edible plant that spreads by prolifically producing seeds, but rarely becomes aggressively invasive, since its seed requires open ground to germinate. The common name, mullein, comes from the German language, meaning king’s candle because of its scepter-like, candle-straight growth. Depending on the summer weather conditions, this wild edible may not produce a lot of flowers. All parts of this plant are covered with star-shaped trichomes. This covering is particularly thick on the leaves, giving them a silvery appearance. As its other name implies, mullein leaves were once used as toilet paper.",
    "edible": "Leaves and flowers. Although the leaves and flowers are edible, enjoying a cup of tea made from these parts is generally preferable. Leaves and flowers can be used in a salad.",
    "sources": ["https://www.ediblewildfood.com/mullein.aspx"]
  },
  {
    "name" : "Pickerelweed",
    "also_known_as": "Pontederia cordata.",
    "description": "Pickerelweed is a valuable food source for large variety of aquatic and terrestrial animals. The large leaves and clusters of stems provide an excellent sanctuary for fish, birds, swimming mammals, amphibians and reptiles. Pickerelweed has a dense root system and stems which provide a wave barrier for protecting shoreline sediment from erosion. Pickerelweed received its name from the pickerel fish, with which this plant is thought to coexist.",
    "edible": "Pickerelweed seeds are tasty when roasted but they can be eaten raw or cooked. They are best collected when they fall into your hand right off the plant. They can be ground and made into flour or toss some seeds into your bread recipe. The young leaves can be eaten as greens; boil older leaves before ingesting. Young stalks are also edible.\nCaution: Be sure that the water source you harvest pickerel from is not polluted.",
    "sources": ["https://www.ediblewildfood.com/pickerelweed.aspx"]
  },
  {
    "name" : "Ramsons",
    "also_known_as": "Allium ursinum, wild garlic, cowleekes, cows's leek, cowleek, buckrams, broad-leaved garlic, wood garlic, bear leek, Eurasian wild garlic, bear's garlic.",
    "description": "Allium ursinum is a bulbous, perennial herbaceous monocot, that reproduces primarily by seed. The narrow bulbs are formed from a single leaf base and produce bright green entire, elliptical leaves up to 25 cm (9.8 in) long x 7 cm (2.8 in) wide with a petiole up to 20 cm (7.9 in) long.[8] The inflorescence is an umbel of six to 20 white flowers, lacking the bulbils produced by some other Allium species such as Allium vineale (crow garlic) and Allium oleraceum (field garlic).The flowers are star-like with six white tepals, about 16–20 mm (0.63–0.79 in) in diameter, with stamens shorter than the perianth.",
    "edible": "Leaves - raw or cooked. Usually available from late January. One report says that they have an overpowering garlic odour that dissipates on cooking, though our experience is that they are considerably milder than garlic. The leaves make a very nice addition to salads, and are especially welcome as a vital and fresh green leaf in the middle of winter. Flowers - raw or cooked. These are somewhat stronger than the leaves, in small quantities they make a decorative and very tasty addition to salads. The flowering heads can still be eaten as the seed pods are forming, though the flavour gets even stronger as the seeds ripen. Bulb - raw or cooked. A fairly strong garlic flavour, though it is quite small and fiddly to harvest. The bulbs can be harvested at any time the plant is dormant from early summer to early winter. Harvested in early summer, they will store for at least 6 months. The bulbs can be up to 4cm long and 1cm in diameter. The small green bulbils are used as a caper substitute.",
    "sources": ["https://en.wikipedia.org/wiki/Allium_ursinum, https://pfaf.org/user/plant.aspx?LatinName=Allium+ursinum"]
  },
  {
    "name" : "Red Clover",
    "also_known_as": "Trifolium pratense, Purple Clover.",
    "description": "Red clover is a wild edible plant belonging to the legume family that is commonly used as food for cattle. This common edible plant has a long and colourful history. Traditional Chinese medicine believed that it was a good tonic for colds, to purify the blood, and at one time they burned it as incense. Native Americans used it as a salve for burns, as well as for bronchial problems. Many cultures have traditionally used red clover to treat whooping cough, respiratory problems, psoriasis, eczema and even cancer. Red clover is one of the herbs in Essiac, and grows in many areas around the world.",
    "edible": "Although leaves can be tossed into a salad or used in a tea, the preferable part of this wild edible is the flower. Red clovers are the tastiest of all clovers although it is recommended not to eat too many of these as some people experience bloating.",
    "sources": ["https://www.ediblewildfood.com/red-clover.aspx"]
  }
]